// 通用文案
"string_key_35"="Confirm";
"string_key_36"="Cancel";
"string_key_38"="Done";
"string_key_33"="Next";
"string_key_34"="Back";
"string_key_37"="OK";
"string_key_405"="I got it!";
"string_key_373"="Retry";
"string_key_163"="Close";
"string_key_152"="Save";
"string_key_42"="Not Save";
"string_key_103"="Coming soon"; // 用于未完成的功能提示
// 日期时间格式
// 启动用户协议弹窗
// 登录主页
"string_key_1"="Login";
"string_key_2"="Register";
// 账号登录
"string_key_176"="Region";
"string_key_11"="Mobile number / E-mail";
"string_key_15"="Please input password";
"string_key_20"="SMS verification";
"string_key_21"="Forgot password";
// 登录提示
"string_key_519"="Mobile number or E-mail error";
"string_key_29"="Login successful";
"string_key_268"="Please enter the correct phone number";
"string_key_269"="Please enter the correct email address";
// 选择区域
"string_key_32"="Search";
// 短信登录
"string_key_13"="Please input mobile number";
// 注册
"string_key_10"="User Agreement";
"string_key_449"="Privacy Policy";
"string_key_31"="I agree《User Agreement》and《Privacy Policy》";
"string_key_343"="User Agreement and Privacy Policy";
// 输入验证码（注册、短信登录、忘记密码、重置密码、绑定手机号、邮箱）
"string_key_25"="Regain";
"string_key_445"="Verification code is sent to %s";
"string_key_27"="Failed to send verification code";
"string_key_28"="Verification code error";
// 输入密码（注册、忘记密码、修改密码）
"string_key_16"="Please input new password";
"string_key_17"="Please re-enter password";
"string_key_266"="Use 6-20 characters with a mix of letters and numbers";
"string_key_18"="Password doesn\'t match";
"string_key_30"="Registered successfully";
// 主页（无设备）
"string_key_48"="No devices";
"string_key_49"="Add Device";
// 主页（有设备）
"string_key_47"="My Devices";
"string_key_50"="Online";
"string_key_51"="Offline";
"string_key_52"="Device Offline";
// 主页（解绑设备）
"string_key_170"="Unbind device";
"string_key_171"="Are you sure to unbind device %s ？After unbinding the device, the device will be removed from the home page. If it is used again, it needs to be reconfigured.";
// 主页（删除共享设备）
"string_key_8"="Delete device";
"string_key_172"="Are you sure to unbind device %s ？This device is a shared device. After deleting the device, the device will be removed from the home page of this account without affecting the use of the device sharer.";
// 主页（我的）
"string_key_80"="Message";
"string_key_164"="Device sharing";
"string_key_345"="More Services";
"string_key_82"="Help & Feedback";
"string_key_83"="About Us";
"string_key_84"="Settings";
// 用户信息
"string_key_173"="Personal info";
"string_key_174"="Profile picture";
"string_key_175"="Nickname";
"string_key_182"="Change nickname";
"string_key_177"="Mobile";
"string_key_178"="E-mail";
"string_key_426"="Unbound";
"string_key_179"="Change Password";
"string_key_180"="Delete Account";
// Android 权限判断
"string_key_155"="To Setting";
// 相册/相机选择
"string_key_184"="Take photo";
"string_key_185"="Select from album";
// 相册
// 用户手机
"string_key_428"="Your mobile number";
"string_key_429"="Change mobile number";
"string_key_430"="You can login with your new mobile number after changing";
// 更换手机号验证
// 绑定手机
"string_key_443"="Bind mobile phone";
// 用户邮箱
"string_key_431"="Your email";
"string_key_432"="Change email";
"string_key_433"="You can login with your new email after changing";
// 更换邮箱验证
// 绑定邮箱
"string_key_442"="Bind E-mail";
"string_key_14"="Please input E-mail";
// 修改密码（验证手机）
// 修改密码（验证邮箱）
// 删除账号
// 消息中心
"string_key_105"="Alarm";
"string_key_106"="Home";
"string_key_107"="Bulletin";
// 消息编辑（通用编辑文案）
"string_key_385"="Edit";
"string_key_44"="Delete";
// 消息加载（通用列表加载文案）
"string_key_40"="Loading...";
"string_key_41"="Already the bottom";
// 无消息（通用无列表数据文案）
"string_key_490"="No data";
// 设备共享
"string_key_165"="Share";
"string_key_166"="Receive";
// 设备共享（设备主人）
"string_key_275"="Not Shared";
"string_key_276"="Shared with %d friends";
"string_key_167"="Share";
"string_key_168"="This device has been shared to";
"string_key_169"="Cancel Sharing";
"string_key_479"="Are you sure to delete the permission of %s?";
"string_key_482"="Remove";
"string_key_480"="Are you sure want to remove the sharing?";
// 设备共享（接收设备）
"string_key_481"="Shared device owner: %s";
// 共享错误提示
// 更多服务
"string_key_362"="Third-party Access Service";
"string_key_346"="XIAODU";
"string_key_347"="TmallGenie";
// 连接音箱
"string_key_348"="Link to Alexa";
"string_key_349"="Link to DuerOS";
"string_key_350"="Link to AliGenie";
"string_key_351"="Use Amazon Echo to voice control your smart devices. Ex:";
"string_key_352"="Use XIAODU to voice control your smart devices. Ex:";
"string_key_353"="Use TmallGenie to voice control your smart devices. Ex:";
// 音箱验证码弹窗
"string_key_354"="Link with Verification Code";
"string_key_355"="Detailed connection description";
"string_key_356"="Verification Code (Once)";
"string_key_357"="How to use the verification code:";
"string_key_358"="1. Start Amazon Alexa App.";
"string_key_359"="1. Start 小度音箱 App.";
"string_key_360"="1. Start 天猫精灵 App.";
"string_key_361"="2. Open the Skill page and enter the verification code.";
"string_key_363"="Copy";
"string_key_364"="Copied";
// 帮助与反馈
"string_key_448"="FAQs";
"string_key_278"="Hotline";
"string_key_447"="Suggestions and Feedback";
"string_key_446"="Feedback history";
// 编辑反馈
"string_key_455"="Issue Type";
"string_key_450"="Please choose Issue Type";
"string_key_453"="Issue Description";
"string_key_451"="Please enter your issue";
"string_key_452"="Contact Method";
"string_key_511"="Please enter your contact method";
"string_key_456"="Submit";
// 反馈提交成功
"string_key_454"="Your feedback is submit to us successfully, we will handle it soon, thanks for your support!";
// 反馈会话
// 关于我们
"string_key_515"="New update";
// 升级弹窗
"string_key_159"="Update now";
// 设置
"string_key_104"="Logout";
// 消息设置
// 通用加载提示
"string_key_71"="Connection timed out";
"string_key_423"="Fail To Connecting Server";
// 网页加载失败
// 配网（选择型号）
// 配网（设置网络）
"string_key_53"="Choose a network to connect";
"string_key_54"="If your Wi-Fi is 5GHz, please set it to be 2.4GHz";
"string_key_274"="Common Router setting method";
"string_key_55"="Select device working wifi";
"string_key_57"="Pls input WIFI password";
// 配网条件检查流程（Android）
"string_key_56"="The phone is not WIFI connected";
"string_key_65"="Connect";
"string_key_484"="Open";
// 配网引导-开启电源
"string_key_472"="Power On";
"string_key_473"="Make sure the robot power in ON";
// 配网引导-设置配网模式
"string_key_483"="Set network configuration mode";
"string_key_500"="Reset the device";
"string_key_61"="Press Recharge button & Partial cleaning button for 5S and release it until hearing voice indication, WIFI indicator flashes";
// A5配网引导
// 搜索设备（Android+满足条件）
"string_key_62"="Choose devices";
// 设备标准名称
// 未搜索到设备
// 连接设备热点
"string_key_63"="Open phone \"setting-WLAN\" and connect to the Wi-Fi network";
"string_key_64"="Confirm hot spot connection, next";
// 配网中
"string_key_66"="Ensure that the Wi-Fi signal is good.";
"string_key_67"="Ensure that the device is powered on.";
"string_key_68"="Scan devices.";
"string_key_69"="Register on Cloud.";
"string_key_70"="Initialize the device.";
// 配网取消
"string_key_467"="If you exit, the device will not be added. Are you sure to exit?";
// 配网失败
"string_key_72"="Check below points and retry";
"string_key_73"="1. Check if the device has been reset and the indicator is blinking slowly.";
"string_key_74"="2. Check if your phone is connected to the device\'s hotspot.";
"string_key_75"="3. Verify the Wi-Fi password.";
"string_key_77"="more device pairing FAQs";
"string_key_76"="Retry";
// 无Wifi配网引导
// 无Wifi配网设置
// 无wifi连接设备热点
// 无wifi配网中（提示开启热点）
// 下方开始是清扫页文案
// 清扫页-无地图
"string_key_39"="No map";
"string_key_422"="Relocate";
"string_key_414"="No rooms mapped";
// 清扫页-功能
"string_key_118"="Map manager";
"string_key_119"="Mode setting";
// 清扫页-工作状态
"string_key_108"="Full cleaning"; // auto
"string_key_109"="Full cleaning paused"; // auto_pause
"string_key_111"="Go to charge"; // return_dock
"string_key_474"="Pause"; // return_dock_pause
"string_key_110"="Go to charge"; // return_navi
"string_key_115"="Relocate"; // return_relocate
"string_key_475"="Zone cleaning"; // paint
"string_key_112"="Zone cleaning Paused"; // paint_pause
"string_key_476"="Room cleaning"; // select
"string_key_113"="Room cleaning paused"; // select_pause
"string_key_114"="Standby"; // stop
"string_key_477"="Relocate"; // relocate
"string_key_116"="Standby"; // suspend
"string_key_308"="Partial cleaning"; // part
"string_key_98"="Charging";
"string_key_415"="Charging finished";
// 清扫页-清扫信息（单位）
"string_key_344"="pings";
// 清扫页-清扫控制
"string_key_91"="Start clean";
"string_key_92"="Pause clean";
"string_key_94"="Clean continue";
"string_key_95"="Recharge";
"string_key_96"="Pause recharge";
"string_key_97"="Recharge continue";
"string_key_85"="Room";
"string_key_86"="Full";
"string_key_87"="Zone";
// 清扫页-清扫区域选择
"string_key_88"="Room clean";
"string_key_89"="Full clean";
"string_key_90"="Zone clean";
// 清扫页-选区划区编辑
"string_key_403"="Add clean location";
"string_key_404"="Clean times";
"string_key_100"="Pls draw clean location"; // 暂无使用
"string_key_101"="Added %d cleaning area";
"string_key_411"="Pls add clean location";
"string_key_410"="Paint zone quantity reach the maximum limit";
"string_key_412"="Pls select clean Room";
"string_key_413"="Added %d cleaning room";
"string_key_499"="Cleanup zone must be within the map.";
// 清扫页-地图加载超时
"string_key_392"="Loading timed out, please try again";
// 清扫页-告警
"string_key_209"="Low Battery";
"string_key_238"="Please recharge";
"string_key_210"="Wheel Suspended";
"string_key_239"="Please put the robot on the ground and start";
"string_key_211"="Wheel Error";
"string_key_240"="Please turn the wheels and clear by hand";
"string_key_212"="Cliff Sensor Error";
"string_key_241"="Please clean the cliff sensor and start the robot away from the cliff";
"string_key_213"="Robot Stuck";
"string_key_242"="Please help robot to get out of trouble";
"string_key_214"="Air Pressure Abnormal";
"string_key_243"="Please close the Self Empty base, or check if filter, air inlet & dust box are blocked";
"string_key_215"="Dust Bag Abnormal";
"string_key_244"="Please check whether the dust bag is installed";
"string_key_216"="Side brush Error";
"string_key_245"="Please check side brush and clean up";
"string_key_217"="Roll brush Error";
"string_key_246"="Please check roll brush and clean up";
"string_key_218"="NoDustBox";
"string_key_247"="请安装尘盒";
"string_key_219"="Bumper Error";
"string_key_248"="Please clean the bumper and tap it";
"string_key_220"="Dust Full Abnormal";
"string_key_249"="Please replace the dust bag immediately";
"string_key_221"="DustCaseExp";
"string_key_250"="尘盒已满";
"string_key_222"="BatteryErr";
"string_key_251"="电池异常";
"string_key_223"="FrontViewErr";
"string_key_252"="前视组件异常";
"string_key_224"="GyroError";
"string_key_253"="陀螺仪组件异常";
"string_key_225"="Fan Error";
"string_key_254"="Fan abnormal, please check it";
"string_key_226"="Wheel decoder Error";
"string_key_255"="Please turn the wheels and clear by hand";
"string_key_227"="LDS Error";
"string_key_256"="Please check LDS and move robot to new location and start";
"string_key_228"="LDS Bumper Error";
"string_key_257"="Please move robot and tap the LDS bumper";
"string_key_229"="Robot tilt";
"string_key_258"="Please put robot on the ground and start";
"string_key_230"="Power Off";
"string_key_259"="Please turn the power on and recharge";
"string_key_231"="Magnetic induction Error";
"string_key_260"="Please put the robot away from magnetic area and start";
"string_key_232"="Mopping Error";
"string_key_261"="Please put the robot away from carpet and start";
"string_key_233"="Forbidden Zone Error";
"string_key_262"="Please put robot away from the forbidden area and start";
"string_key_234"="Wall Sensor Error";
"string_key_263"="Please clean the wall sensor";
"string_key_235"="ResetErr";
"string_key_264"="Inner error, please start after factory default reset";
"string_key_236"="Adapter Error";
"string_key_265"="Please use the specified adapter";
"string_key_485"="The robot is trapped";
"string_key_486"="Please remove obstacles around the robot or move robot to a new location to start";
"string_key_487"="Partial cleaning Error";
"string_key_488"="Please put the robot in the area to be cleaned and then start partial cleaning";
// 清扫参数编辑弹窗
"string_key_120"="Suction";
"string_key_121"="Water";
"string_key_382"="No mop installed";
// 吸力
"string_key_128"="Close";
"string_key_129"="Mute";
"string_key_130"="Standard";
"string_key_131"="Strong";
"string_key_132"="Maximum";
// 水量
"string_key_128"="Close";
"string_key_127"="Low";
"string_key_126"="Medium";
"string_key_125"="High";
"string_key_425"="Maximum";
// 清扫次数（暂无使用-预留）
// 地图管理弹窗-未开启保存地图
"string_key_489"="Map Saving not enabled.";
"string_key_369"="It will partition the map, customize personalized sweep scheme after open";
// 未开启存图提示
"string_key_390"="Map Saving not enabled. Enable to use this function";
// 地图管理弹窗-开启保存地图
"string_key_365"="Current map";
"string_key_367"="New map";
"string_key_366"="Map";
"string_key_145"="Forbidden Area";
"string_key_146"="Zone edit";
"string_key_147"="Customize";
"string_key_148"="Cleaning order";
// 地图管理-未开启保存地图
"string_key_370"="Map save";
"string_key_375"="Map saved instructions:";
"string_key_463"="Open the map save mode, then you can save maps manually and the map will be partitioned automatically.";
"string_key_464"="After saving the map, you can change the name of the map, add or modify the forbidden area and virtual wall, and switch the map to the home page.";
"string_key_465"="Up to 4 maps can be saved, which is used for the management of multi-floor maps.";
"string_key_466"="After saving the map, if you find the map and the route are chaotic, or the cleaning behavior is abnormal, please delete the map and build the map again.";
// 地图管理-已开启保存地图
"string_key_387"="Mapping";
"string_key_368"="Incomplete maps will not be saved.";
"string_key_384"="Rename";
"string_key_386"="Switch";
"string_key_374"="Create new map";
"string_key_372"="Fail To Get"; // 加载失败提示
// 地图管理-保存地图提示
"string_key_400"="Save as new map";
// 地图管理-命名
"string_key_388"="Map name";
// 地图管理-删除地图提示
"string_key_389"="Are you sure delete map %s?";
// 地图管理-创建新地图
"string_key_395"="Map Creation Guide";
"string_key_396"="1. Open the doors for all rooms.";
"string_key_397"="2. Clear floors of obstacles to ensure precise mapping.";
"string_key_398"="3. Do not pick up or move the robot during mapping.";
"string_key_402"="Create";
// 地图管理-关闭地图保存提示
"string_key_394"="If disabled, all current maps and settings will be deleted.";
// 禁区编辑
"string_key_149"="Virtual Wall";
"string_key_150"="No-Go Zone";
"string_key_151"="No-Mop Zone";
"string_key_435"="Maximum number of Virtual Walls reached";
"string_key_436"="Maximum number of Forbidden Areas reached";
// 禁区编辑-检查提示
"string_key_406"="Charging base is within Forbidden Area or Virtual Wall. Recharging may fail if saved";
"string_key_407"="Robot may be within Forbidden Area or Virtual Wall. Start may fail if saved";
"string_key_457"="Forbidden Area is too close to charging base, pls adjust forbidden area";
"string_key_458"="Virtual Wall is too close to charging base, pls adjust virtual wall";
// 分区编辑
"string_key_501"="Zone division";
"string_key_503"="Zone merge";
"string_key_505"="Zone rename";
// 操作提示
"string_key_502"="Pls select a zone to divide";
"string_key_512"="Pls draw division line on area";
"string_key_504"="Pls choose to merge the nearby area";
"string_key_506"="Pls choose the renamed area";
// 编辑错误提示
"string_key_513"="Room limit reached";
"string_key_514"="No mergeable zone";
// 房间名称
"string_key_522"="Zone name";
"zone_name_0"="Room";
"zone_name_1"="Dinning room";
"zone_name_2"="Kitchen";
"zone_name_3"="Bedroom";
"zone_name_4"="Restroom";
"zone_name_5"="Elder's room";
"zone_name_6"="Children's room";
"zone_name_7"="Master room";
"zone_name_8"="Bedroom";
"zone_name_9"="Study room";
"zone_name_10"="Balcony";
"zone_name_11"="Living room";
"zone_name_12"="Corridor";
"zone_name_13"="Cloakroom";
// 定制模式
"string_key_509"="Clear mode";
"string_key_507"="Pls choose zone,set the suction power and amount of water";
"string_key_517"="Not customized";
"string_key_518"="Cancel customize";
// 定制顺序
"string_key_516"="Clear order";
"string_key_508"="Choose areas to set cleaning sequence";
// 设备-设置
"string_key_143"="Find my robot";
"string_key_133"="Robot setting";
"string_key_134"="Manage Maps";
"string_key_135"="Voice and volume";
"string_key_136"="Scheduled cleaning";
"string_key_137"="Pin n Go";
"string_key_138"="Remote control";
"string_key_139"="Cleaning history";
"string_key_140"="Maintenance";
"string_key_141"="Customer service";
"string_key_510"="Feedback";
"string_key_142"="Firmware update";
"string_key_144"="Delete device";
// 机器人设置
"string_key_4"="Device name";
// 暂时隐藏-预留
"string_key_290"="Carpet mode";
"string_key_291"="When robot detect carpet area, it will increase suction power automatically,resume the normal suction power after left the carpet.";
"string_key_292"="Break point resume";
"string_key_293"="If robot don\'t complete the clean due to low battery, it will continue to complete the previous clean after recharging.";
"string_key_521"="Y-Shape cleaning";
"string_key_459"="Robot time zone";
"string_key_296"="Do not Disturb mode";
"string_key_297"="Robot will not resume cleanup after the defined time. Voice alert volume will be reduced.";
"string_key_191"="Start";
"string_key_298"="End";
"string_key_299"="Unit of area";
// 时间选择弹窗
"string_key_205"="h";
"string_key_206"="min";
// 面积单位选择弹窗
"string_key_417"="Square meter(m²)";
"string_key_418"="Foot(ft²)";
"string_key_419"="Ping";
// 语音设置
"string_key_300"="Voice volume";
"string_key_301"="Slide to adjust volume";
"string_key_302"="Robot voice";
"string_key_305"="Current";
"string_key_306"="Use";
"string_key_303"="Standard Chinese";
"string_key_307"="Classic Girl Voice";
"string_key_304"="English";
// 定时清扫-列表
"string_key_520"="Delete this schedule?";
// 定时清扫-编辑
"string_key_190"="Set schedule";
"string_key_192"="Repeat";
"string_key_193"="Clean mode";
"string_key_424"="Schedule already exists";
// 定时清扫-周期弹窗
"string_key_194"="Once";
"string_key_197"="Everyday";
"string_key_196"="Weekdays";
"string_key_195"="Weekends";
"string_key_207"="Custom";
// 定时清扫-周选择弹窗
"string_key_198"="Sunday";
"string_key_199"="Monday";
"string_key_200"="Tuesday";
"string_key_201"="Wednesday";
"string_key_202"="Thursday";
"string_key_203"="Friday";
"string_key_204"="Saturday";
// 指哪到哪
"string_key_309"="Go there";
"string_key_93"="Pause";
"string_key_420"="Cleaning in progress. Pause clean and Ping n Go?";
"string_key_408"="Stop going to target point?";
// 遥控模式
"string_key_460"="Recharge";
"string_key_421"="Cleaning in progress. Pause clean and remote control";
"string_key_189"="To prevent accidental damage, keep an eye on the robot when using Remote Control.";
// 清扫记录列表
"string_key_310"="Total time";
"string_key_312"="Total area";
"string_key_313"="Total cleanups";
// 清扫记录-启动方式
"string_key_324"="App start";
"string_key_325"="Remoter start up";
"string_key_326"="Start scheduled cleaning";
"string_key_327"="Robot start up";
"string_key_328"="Speaker start up";
"string_key_461"="Started with button";
// 清扫记录-完成状态
"string_key_329"="Cleaning completed";
"string_key_330"="Manual interruption";
"string_key_469"="Low power interruption";
"string_key_331"="Abnormal interruption";
"string_key_492"="Return to Recharge";
// 清扫记录详情
"string_key_314"="Cleanup details";
"string_key_316"="Cleaned time";
"string_key_315"="Cleaned area";
// 耗材维护列表
"string_key_317"="Side brush";
"string_key_318"="Roll brush";
"string_key_319"="Filter";
"string_key_320"="Sensor maintain";
"string_key_321"="Routine maintenance";
"string_key_322"="Remaining %dh Replaced";
"string_key_468"="Remaining %dh Clean";
// 耗材维护详情
"string_key_333"="Used";
"string_key_334"="Remaining";
"string_key_335"="The role of side brushes is to gather the corner trash to under the roller brush of the robot so that it can be sucked in. There will be abrasion during the working process, which will affect the cleaning efficiency. It is recommended to replace it every ≤%d hours.";
"string_key_336"="Roller brush rolls trash into the dust box through high-speed rotation, which will be abrasive during the working process, which will affect the cleaning efficiency. It is recommended to replace it every ≤%d hours.";
"string_key_337"="The filter element can effectively prevent the dust sucked into the dust box from overflowing. In order to avoid blocking of the filter element and affecting the cleaning efficiency, the high-efficiency filter and filter sponge should be regularly replaced. It is recommended to replace the high-efficiency filter every ≤%d hours.";
"string_key_338"="The sensor includes TOF sensors and anti-drop sensors to prevent the robot from hitting and falling. They may be contaminated with dust during the working process that can cause abnormal induction. It is recommended to wipe it with a dry cloth every %d hours of work.";
"string_key_340"="Maintain your device in good working condition";
"string_key_341"="Reset";
"string_key_342"="Clean sensors"; // 传感器专用
// 联系客服
"string_key_279"="Service Email";
"string_key_280"="WeChat";
"string_key_281"="Product information";
"string_key_282"="Report logs";
// 产品信息
"string_key_283"="Serial number";
"string_key_284"="App version";
"string_key_285"="Cpu1 version";
"string_key_286"="Cpu2 version";
"string_key_287"="Wi-Fi name";
"string_key_288"="IP address";
"string_key_289"="MAC address";
// 固件更新-有更新
"string_key_161"="Check for Firmware Update";
"string_key_157"="Current version:";
"string_key_158"="Latest version:";
// 固件更新-更新中及错误提示
"string_key_162"="Upgrading";
"string_key_478"="Device is low battery, in order to avoid upgrade failed,pls charge the device with full electricity before upgrade again";
"string_key_498"="Please move the robot to charging base for upgrading";
"string_key_494"="The upgrade takes about 3 ~ 5 minutes. Do not turn off the power and keep the network good. Wait until the upgrade is completed.";
"string_key_495"="Automatic Updates";
"string_key_496"="The device will be automatically updated. But some key device features still need to be confirmed to update.";
"string_key_497"="Devices will be temporarily offline and updated during inactive time.";
"string_key_187"="Upgrade failed";
// 固件更新-弹窗
"string_key_160"="There are large update of this version,it can continue to use the product only after upgrade";
"string_key_186"="Upgrade success"; // 固件更新-弹窗-升级成功
"string_key_493"="New version voice found";
// 控制设备提示信息
"string_key_393"="Cleaning in progress. End clean and return to charge?";
"string_key_371"="Cleaning in progress. Return to dock before use";
"string_key_383"="End current clean and start new clean?";
"string_key_381"="Cleaning in progress. End the clean before editing.";
"string_key_470"="Cleaning completed, new map found";
"string_key_471"="Cleaning completed, new area found";
"string_key_462"="Response timeout";
// 预留词汇
"string_key_153"="Pls dreaw new forbidden zone";
// 下面是Ios专用词汇
"string_key_22"="Verification Code";
"string_key_23"="Input verification code";
"string_key_24"="Get Code";
"string_key_45"="Password login";
"string_key_154"="At present, precise positioning is not enabled, which will affect your wifi access";
"string_key_156"="Location service is not currently enabled on the phone";
"string_key_267"="Account cannot be empty";
"string_key_270"="remaining";
"string_key_272"="Reset password";
"string_key_271"="Reset success";
"string_key_273"="Reset";
"string_key_277"="Please enter account";
"string_key_332"="Continue";
"string_key_409"="No map";
"string_key_444"="Binding success";
"string_key_401"="Update";
"string_key_491"="If no token is obtained, check whether the mobile phone is connected to the Internet";
// Ios Key 用到 string_key_522
// 下面是A5控制页所用词汇
// A5清扫页
// A5设置页

// 20220325
"string_key_523"="Partial clean"; // 动词
"string_key_524"="Select Region";
"string_key_525"="Notification";
"string_key_526"="Report Issue";
//"string_key_527"="Delete Account"; // string_key_180

//"string_key_528"="Dear user"; // 动词
//"string_key_529"="If you confirm to delete account, the account will be deleted on";
"string_key_528"="Dear user/nIf you confirm to delete account, the account will be deleted on";
"string_key_530"="Your account data will be deleted.";
"string_key_531"="If you don't want to delete account, please login to the App before the above mentioned time to withdraw the request.";
"string_key_532"="Thanks for using our App.";
"string_key_533"="Continue";
"string_key_534"="Password is changed,Please sign in again";
"string_key_535"="Click Get Verification Code to send the verification code to the mobile: %s";
"string_key_536"="Click Get Verification Code to send the verification code to the email: %s";
"string_key_537"="Authentication";
"string_key_538"="Use Google Home to voice control your smart devices. Ex:";
"string_key_539"="Link to Google";
"string_key_540"="1. Start Google Home App.";
"string_key_541"="Time Out";
"string_key_542"="The users you are inviting are located in different region and may not be able to share devices";
"string_key_543"="The maximum font limit has been exceeded";
"string_key_544"="updata loading";
"string_key_545"="Current edit is not saved, save or not?";
